"""
Задача №1.

Тетяна кожен день лягає спати рівно опівночі і нещодавно дізналась,
що оптимальний час для її сну становить t хвилин. Тетяна хоче поставити
собі будильник так, щоб він продзвенів рівно через t хвилин після півночі,
однак для цього необхідно вказати час сигналу у форматі години і хвилини.
Допоможіть Тані визначити, на який час завести будильник. Години і хвилини у
виведенні програми повинні розташовуватися на різних рядках.

Автор: Костючик Валерія Дмитрівна
"""

t = int(input("Введіть тривалість сну у хвилинах: "))


hours = t // 60
minutes = t % 60


print("Час для поставлення будильника:")
print("Години:", hours)
print("Хвилини:", minutes)





    
