"""
Задача №4.

Дано рядок. Замініть у цьому рядку усі входження певної літери англійського
алфавіту, яку вводить користувач у нижньому регістрі, на відповідну літеру
у верхньому регістрі. Спочатку вводиться літера, а потім рядок, у якому
треба виконати заміну.

Автор: Костючик Валерія Дмитрівна
"""

letter = input("Введіть літеру для заміни: ").lower()
string = input("Введіть рядок для заміни: ")


mod_string = string.replace(letter, letter.upper())


print("Результат після заміни:", mod_string)



