"""
Задача №1.

Тетяна кожен день лягає спати рівно опівночі і нещодавно дізналась,
що оптимальний час для її сну становить t хвилин. Тетяна хоче поставити
собі будильник так, щоб він продзвенів рівно через t хвилин після півночі,
однак для цього необхідно вказати час сигналу у форматі години і хвилини.
Допоможіть Тані визначити, на який час завести будильник. Години і хвилини у
виведенні програми повинні розташовуватися на різних рядках.

Автор: Костючик Валерія Дмитрівна
"""
# Отримати від користувача час сну у хвилинах
t = int(input("Введіть тривалість сну у хвилинах: "))

# Розрахувати години і хвилини для будильника
hours = t // 60
minutes = t % 60

# Вивести результат
print("Час для поставлення будильника:")
print("Години:", hours)
print("Хвилини:", minutes)

"""
Задача №2.

Потрібно підрахувати, на скільки раніше буде закінчуватися k-й урок,
якщо всі перерви скоротити на 5 хвилин. Вводиться одне натуральне число k,
не більше 7. Необхідно вивести одне натуральне число - час у хвилинах.

Автор: Костючик Валерія Дмитрівна
"""

# Отримати від користувача номер уроку k
k = int(input("Введіть номер уроку (не більше 7): "))

# Визначити тривалість уроків та перерв у хвилинах
t_ur = 45
t_per = [5, 10, 20, 10, 10, 5, 10]

# Перевірити, чи введений номер уроку в діапазоні від 1 до 7
if 1 <= k <= 7:
    # Розрахувати час тривалості уроків та перерв для перших k-1 уроків
    s_t_ur = (k - 1) * t_ur
    s_t_per = sum(t_per[:k - 1])

    # Загальний час у хвилинах
    t = s_t_ur + s_t_per

    # Скоротити перерви на 5 хвилин
    new_t = t - (5 * (k - 1))

    # Вивести результат
    print("Загальний час у хвилинах після скорочення перерв на 5 хвилин:", new_t)
else:
    print("Невірний номер уроку. Введіть число від 1 до 7.")

"""
Задача №3.

Напишіть програму для друку літери Е висотою 5 рядків за допомогою
введеного користувачем символу

Автор: Костючик Валерія Дмитрівна
"""
# Отримати від користувача символ для відтворення літери "Е"
symbol = input("Введіть символ: ")

# Друкувати літеру "Е" висотою у 5 рядків
print(symbol * 5)
print(symbol)
print(symbol * 5)
print(symbol)
print(symbol * 5)


"""
Задача №4.

Дано рядок. Замініть у цьому рядку усі входження певної літери англійського
алфавіту, яку вводить користувач у нижньому регістрі, на відповідну літеру
у верхньому регістрі. Спочатку вводиться літера, а потім рядок, у якому
треба виконати заміну.

Автор: Костючик Валерія Дмитрівна
"""

# Отримати від користувача літеру та рядок
letter = input("Введіть літеру для заміни: ").lower()
string = input("Введіть рядок для заміни: ")

# Перевірити, чи введено лише одну літеру
if len(letter) == 1 and letter.isalpha():
    # Виконати заміну у рядку
    mod_string = string.replace(letter, letter.upper())

    # Вивести результат
    print("Результат після заміни:", mod_string)
else:
    print("Будь ласка, введіть лише одну літеру.")

    
